#Дан список чисел [42, 69, 322, 13, 0, 99, -5, 9, 8, 7, -6, 5]
#Нужно выписывать из этого списка только положительные числа до тех пор, пока не встретите отрицательное или не закончится список (выход за границу).
#Запишите исходный список в переменную my_list.
#Напишите цикл while с соответствующими задаче условиями.
#Используйте операторы прерывания/продолжения цикла в соответствии с условиями задачи.

my_list = [42, 69, 322, 13, 0, 99, -5, 9, 8, 7, -6, 5]
i = 0
while i < len(my_list) and my_list[i] >= 0:
    if my_list[i] > 0:
        print(my_list[i])
    i += 1
    continue
else:
    print(f'Outside of range / Negative number found on iteration {i}')


